<?php
namespace frontend\controllers;
use frontend\models\Bmi;
use Yii;
class BmiController extends \yii\web\Controller
{

  public function actionCal()

  {
    $bmi = null;
    $model = new Bmi ();


    if ($model->load(Yii::$app->request->post())) {
      # code...
      $bmi = $model->weight / ($model->height * $model->height);
      $gradebmi = $model-> if( $bmi <= 20){
      print " คุณผอมมาก คุณควรเพิ่มนำหนักมากกว่านี้ค่ะ<br><br> "
      print " &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;คุณควรปรับเปลี่ยนการรับประทานอาหาร ดังนี้ <br><br>
      1. เน้นกินอาหารที่เพิ่มพลังงาน เช่นแป้ง น้ำตาล ผัก ผลไม้ ให้มากกว่าเดิม แต่ควรให้หมุนเวียนชนิดกันไป และการเพิ่มน้ำหนักที่ดีควรเพิ่มไม่เกินสัปดาห์ละ 0.5-1 กิโลกรัม อย่างสม่ำเสมอ<br><br>
      2. กินอาหารให้ได้สัดส่วนทั้งคาร์โบไฮเดรท โปรตีน ไขมัน แทนที่จะเพิ่มแต่ของหวาน ๆ มัน ๆ อย่างที่นิยมกัน เพราะถ้าเพิ่มน้ำหนักวิธีนั้นจะได้เป็นไขมันสะสมตามหน้าขา หน้าท้อง ต้นขา ซึ่งคงไม่มีใครอภิรมย์แน่ค่ะ <br><br>
      3. เลือกอาหารชนิดที่ให้พลังงานสูง แต่จานไม่ใหญ่นัก เช่น ระหว่างสลัดผักกับไข่ดาวกับสเต็กปลา สเต็กปลาอาจจะให้พลังงานมากกว่าขณะที่กินในปริมาณที่น้อยกว่า <br><br>
      4. เพิ่มมื้อย่อยรวมเป็น 4-6 มื้อต่อวัน โดยเพิ่มมื้ออาหารว่างเข้าไป เช่น ซาลาเปาไส้ถั่วดำ 1 ลูก น้ำส้มคั้น 1 แก้ว หรือถั่วต้ม เป็นต้น<br><br>
      5. เพิ่มวิตามินและเกลือแร่ โดยเฉพาะวิตามินบีรวม จะช่วยเพิ่มความอยากอาหาร และช่วยเผาผลาญอาหารในร่างกายให้เป็นพลังงาน <br><br>
      6. นอนหลับพักผ่อนให้เพียงพอ เพราะขณะหลับร่างกายจะใช้พลังงานน้อยลง"
      }
      if($bmi >20 && $bmi < 24.0)
      {
      print "คุณกำลังหุ่นดีเลยคะ อยู่ในเณฑ์ปรกติคะ,อย่าให้อ้วนกว่านี้นะคะ<br><br>";
      print "&nbsp;&nbsp;&nbsp;&nbsp;เนื่องจากคุณเป็นคนหุ่นดีอยู่แล้ว ไม่ต้องปรับเปลี่ยนการรับประทานอาหารมากนัก คุณควรคำนึงอยู่เสมอว่า การกินทุกครั้งไม่ใช่เพราะความอยากอาหาร แต่กินเพราะร่างกายจำเป็นต้องใช้พลังงาน และสารอาหารในการดำรงชีวิตอันก่อให้เกิดสุขภาพดี รักษาหุ่นอย่างนี้ต่อไปนะคะ";
      }
      if($bmi >=24 && $bmi < 29)
      {
      print "คุณเริ่มอ้วนแล้วละ สิ่งที่ดีที่สุดควรปรับเปลี่ยนนิสัยตามใจปากได้แล้ว<br><br>";
      print " &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;คุณควรปรับเปลี่ยนการรับประทานอาหาร ดังนี้<br><br>
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เลือกอาหารที่ช่วยเพิ่มการเผาผลาญพลังงานอย่าง ธัญพืช ถั่วต่างๆ ผักสีต่างๆ และเน้นอาหารเส้นใยสูงอย่าง ข้าวซ้อมมือ ขนาปังโฮลวีท รวมถึงเลือกอาหารที่มีโปรตีนไขมันต่ำ อย่างเต้าหู้ ปลา ไก่ไม่ติดหนัง ผลไม้ที่มีน้ำเยอะไม่หวานระหว่างมื้ออาหารอย่าง แอปเปิ้ล ฝรั่ง ชมพู่ สาลี่ โดยควรลดแป้ง น้ำตาล และไขมัน เพื่อป้องกันไขมันสะสม และห้ามทานอาหารหลัง 20.00 น. เพราะจะทำให้อาหารย่อยไม่หมด ควรออกกำลังกายสม่ำเสมอ เลือกกีฬาที่ชอบและเหมาะกับสภาพร่างกายเราค่ะ";
      }
      if($bmi >= 29)
      {
      print "คุณอ้วนมากๆ รีบไปออกกำลังกายซะ...ไม่งั้นจะแย่นะเรา!!<br><br>";
      print"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;คุณควรปรับเปลี่ยนการรับประทานอาหาร ดังนี้<br><br>
      1 เลือกทานอาหารแต่ละชนิดควรมีผัก ผลไม้ทุกมื้อ ถ้ามื้อไหนไม่มีผักก็ควรมีผลไม้ เช่น ส้มโอ ฝรั่ง ส้ม เป็นต้น อาหารพวกคาร์โบไฮเดรตให้ทานเป็นข้าวซ้อมมือหรือข้าวกล้อง หรือขนมปังโฮลวีตค่ะ<br><br>
      2 กำจัดอาหารพวกเนื้อแดงให้น้อยลง เช่นพวกเนื้อวัว เนื้อหมู ถ้าอยากทานให้ทานได้ 1 ชิ้นต่อวัน ชิ้นต้องไม่ใหญ่มากและต้องไม่ติดมัน<br><br>
      3 ห้ามทานอาหารหลัง 20:00 น. หรือหลังจาก 3 ชั่วโมงก่อนเข้านอน เพราะอาหารจะย่อยไม่หมด จะตกค้าง กลายเป็นไขมัน และท้องอืด และควรดื่มน้ำวันละ 8 แก้ว<br><br>
      4 กำจัดอาหารที่ไม่ควรทานออกนอกสายตาไปซะ เช่นพวกขนมขบเคี้ยว เอาออกไปให้หมด ทั้งในตู้เย็น และชั้นวางขนม เปลี่ยนเป็นผักสดเช่น แตงกวา แครอทหั่นเป็นแท่งไว้กินเล่นแทน<br><br>
      5 ให้ทานอาหารให้เป็นเวลา และครบทั้ง 3 มื้อโดยเฉพาะมื้อเช้าเลิกนิสัยทานเมื่อหิวไปเลย เพราะจะทำให้เป็นโรคกระเพาะได้และยังทำลายระบบการเผาผลาญของร่างกายไปด้วยค่ะ และที่สำคัญ เวลาหิว มักจะทานอาหารมากกว่าปกติค่ะ<br><br>
      6 หาวิธีเผาผลาญพลังงานเพิ่มเช่น เดินขึ้นลงบันไดซํก 1-2 ชั้น แล้วค่อยไปต่อลิฟธ์แทนการขึ้นลิฟธ์ทั้งหมด เดินย่อยหลังอาหารวันละ 15 นาที ถ้าจะให้ดี ควรออกกำลังกายสม่ำเสมอ เลือกกีฬาที่ชอบและเหมาะกับสภาพร่างกายเราค่ะ";
    print "คุณอ้วนมากๆ รีบไปออกกำลังกายซะ...ไม่งั้นจะแย่นะเรา!!<br><br>";
    } ;





    }

    return $this ->render('cal',[
        'model' => $model,
        'bmi' => $bmi,
        'gradebmi' => $gradebmi,


    ] );
  }
}






 ?>
