<?php
use yii\helpers\Html;
?>
<h1>ระบบบบริหารจัดการความเสี่ยง FAKTHARM</h1>
ระบบบริหารจัดการความเสี่ยง FAKTHARM เป็น โปรแกรมสำหรับการจัดทำรายงานความเสี่ยงผ่านระบบคอมพิวเตอร์ เพื่ออำนวยความสะดวกในการเขียนรายงานความเสี่ยง
แก่เจ้าหน้าที่ผู้ปฏิบัติงาน มีระบบกำหนดสิทธิ์การเข้าถึงข้อมูล สำหรับ ผู้ใช้ทั่วไป(ที่ได้รับสิทธิ์ในการเข้าถึงการรายงาน) ผู้จัดการความเสี่ยง ที่สามารถแก้ไข ปรับปรุง
รายการ มีรายงานหมวดหมู่ต่างๆ ตามการจำแนก แผนก ประเภทความเสี่ยง ความรุนแรง โปรแกรมความเสี่ยง และติดตามสถานะ ของรายการ
พัฒนาโดย  งานเทคโนโลยี่สารเทศ โรงพยาบาลฟากท่า เมื่อ 2559  ปรับหลายเวอร์ชั่น

 เวแร์ชั่นล่าสุด ปรับปรุง ฟอร์มรายงานให้สอดคล้องกับ บริบท และการใช้งานผู้ใช้ มีระบบ เตือน ผ่านระบบ กลุ่ม line เมื่อ วันที่ 4 ก.พ.2561
